# IFCParameter Template Remove Property Mapping Info(Property Setup Type, String, String) Method

Source: https://www.revitapidocs.com/2026/fa40faa8-1927-da6a-cad8-8e6adbff942b.htm

---

| IFCParameter Template Remove Property Mapping Info(Property Setup Type, String, String) Method |
| --- |

Removes the property mapping from the property set by name.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	string propertySetName,
	string propertyName
)
```

```
Public Sub RemovePropertyMappingInfo (
	propertySetupType As PropertySetupType,
	propertySetName As String,
	propertyName As String
)
```

```
public:
void RemovePropertyMappingInfo(
	PropertySetupType propertySetupType,
	String^ propertySetName,
	String^ propertyName
)
```

```
member RemovePropertyMappingInfo :
        propertySetupType : PropertySetupType *
        propertySetName : string *
        propertyName : string -> unit
```

#### Parameters

propertySetupType PropertySetupType
:   The property setup type.

propertySetName String
:   The property set name.

propertyName String
:   The property name.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

See Also

#### Reference

IFCParameterTemplate Class RemovePropertyMappingInfo Overload Autodesk.Revit.DB Namespace